[
    {
        "_id": "65d26def55012b65d9e0ace9",
        "type":"blog",
        "title": "Helper Relationship with Husband",
        "content": "Helper relationship with husband Helper too close relationship with husband of household\n\nA frustrated wife took to social media asking for advice on her next steps after she found out that her husband was having a relationship with their maid.\nthe woman wrote: “I would like advice on what I can do to terminate the maid hired by my husband or what kind of legal action is possible if I am not ready for a legal separation divorce at the moment”. She added that her husband was protective of the maid but said she could not let their relationship go on. She did not have concrete proof of his infidelity.\n\n“She is stirring trouble at home by causing dispute between my husband and me.. she knows how to play her cards and my mother in law has taken her, my son and my husband into her home”, the woman wrote.\nShe added that she had been providing for the family as her husband was not working, but since they moved into her mother-in-law’s house, he started working to support the maid and pay for their son’s expenses.\nA maid in a relationship with a local guy and then unceremoniously dumped him wrote that hers was “Not your Cinderella kind of story”. the maid wrote that she had been working in Singapore for about a decade. She was an unwed single mother with a teenage son.\n\n“In my first five years here working I’ve met a local Singaporean guy and we became a couple for a year. It ended so quick because I found out that he’ll marry the one that his parents want him to spend with for the rest of his life. Yes, it’s an arranged marriage. Why? Because I am a maid and she works and earns more than my ex, i am a single mom and she’s single without baggage, i am financially unstable and she came from a well off family both here in Singapore and her home country”, she wrote.",
        "featured_image_url": "https://i.ibb.co/1sbmxF7/2.png"
    },
    {
        "_id": "65d26def55012b65d9e0acea",
        "type":"blog",
        "title": "Maid spikes baby’s milk with Panadol in CCTV",
        "content": "Maid spikes baby’s milk with Panadol in CCTV footage; parents trusted her because of her good job performance & attitude\n\nParents of a newborn son were shocked to see through CCTV footage that their domestic helper was abusing their child.\nThe family also discovered hundreds of pills in their helper’s drawer, which the latter used to spike the three-month-old baby’s milk on multiple occasions.\nMr Lin hired the 27-year-old helper from Myanmar in Aug 2021.\nShe initially performed well at her job and had a good attitude.\nHowever, Mr Lin saw through CCTV footage\nAlthough they didn’t punish the woman for what happened, the employers reminded her of her responsibility to care for the infant.\nTwo months later, they witnessed the helper dragging the child by the arm across his crib.\nThe couple went through the CCTV footage once more this year after noticing their son stopped gaining weight.\n\nThey saw the helper opening a cabinet to retrieve a pill during their son’s feeding time.\nThe woman walked towards a blind spot of the camera before presumably spiking the milk with the pill and shaking the bottle.\n“The blood test report came out fine, but he was much thinner than other children of the same age, and I was worried that his development would be affected,” said Mr Lin.\nThe parents informed the police when the incident happened on May 12.\nUpon investigation, the helper admitted to putting Panadol in the milk, noting this was not the first time she had done so.\nShe also claimed to put an appetite-boosting pill from her country into the drink.\nIt was reported that Mrs Lin discovered hundreds of pills in the helper’s drawer, some dating as far back as August last year.\nThey initially assumed the Panadol and flu & cough medicine were for the woman when she felt unwell.\n\nThey never thought the pills would be used to spike their son’s milk.\nThe family has since hired a new helper, whom they will monitor more closely.\nThe case is currently under police investigation.\nResponding to the incident, parents admitted they never felt comfortable leaving their young children with a domestic helper.\n“I never trusted a maid to take care of my kids when they were small,” said Facebook user William Lim, followed by another parent who said the incident “was a reason why he didn’t want to have any maid looking after his kids.”\n\n\n\n\n",
        "featured_image_url": "https://i.ibb.co/1sbmxF7/2.png"
    },
    {
        "_id": "65d26def55012b65d9e0aceb",
        "type":"blog",
        "title": "Family Privacy Compromised",
        "content": "A foreign domestic helper took to social media justifying that as long as she did not reveal her employer’s address or personal details in the photos or videos she took, she should be allowed to post the images.\nOne employer took to a social media group asking domestic helpers for their thoughts on taking videos in their employer’s house and posting them online. The woman “Dear Helpers, I’d like to seek your point of view. I’ve noticed on other pages conflicts between helpers and employers about taking videos to post on social media”.\nShe added that the videos were taken in the employer’s house without permission. She then asked helpers in the group: “For those who do take videos in the employer’s residence to post on social media, what’s your thoughts on this? I’d like to seek views from everyone who both does this and doesn't this, just to understand everyone’s thoughts and position on this topic”.\nOne helper: “For example I’m in my room at night, after work, I take photos of myself, of course, behind me is my employer’s wall. Am I compromising their privacy and safety by doing so? If the employer is so strict about their doors or walls or ceiling popping up as the background of my selfie after work, I don’t think I can work from them. What is scary is when we take photos and videos outside the employer’s house showing the blk, house number, or in the hallway showing a clear description of their location.. I know my boundaries, I know what to post and what not to”.\n\nMost others said that the matter should be discussed beforehand with the employers. Another helper said: “Employers should inform the helper first and foremost about their rules of not putting their family especially kids on social media.. because some employers were okay, some are not .. and for the helpers like me , if they forgot to inform us ,we need to ask our employers if they’re okay posting them .. Everybody needs their privacy right.. so we need to respect each other. No hate. Just love”.\nAccording to the Advisory Guidelines on the Personal Data Protection Act, the following example was given: “Photo-taking by an individual acting in a personal or domestic capacity Diana, an employee of Organisation XYZ, attends XYZ’s corporate social responsibility event. At the event, she meets her friend Dawn. During a break in the programme, they have a personal chat and catch up on each other’s personal lives. During the chat, Diana takes a photograph of the two of them to update her friends of the encounter via social media. Diana then uploads the photograph and displays it on her personal social media page. In this instance, Diana would likely be considered to be an individual acting in a personal or domestic capacity, and would not be required to comply with the Data Protection Provisions in respect of the photo-taking and subsequent disclosure of the photograph via her social media account.\nNotwithstanding the above, the Data Protection Provisions may apply in other contexts where Diana is not acting in a personal or domestic capacity. For example, if the photograph is subsequently published for XYZ’s publicity purposes (such as in XYZ’s corporate brochures or website) instead of for Diana’s personal purposes, the Data Protection Provisions are likely to apply to XYZ in respect of the collection, use and disclosure of the photograph. For example, XYZ will have to obtain Dawn’s consent before publishing her photograph for XYZ’s business purpose”.\nEarlier this year, a frustrated employer of a foreign domestic helper complained on social media that her maid would not only “scold her vulgarities” on TikTok videos but also “wear makeup at home, wear s*xy underwear, tiktok around the house and then she told us she cannot finish her duties because she has too many things to do”.\nThe woman, also her neighbor’s maid, also said that her helper “has a Facebook with a lot of guys chatting. Her private life yes but she is also married with kids back in the Philippines”. The employer wrote that she had spoken to her maid over five times asking her not to film TikToks in the house, or even in her room as they were a private family. “It is ok for her to have a TikTok account and dance outside or with her friends. I don’t think I should control her use of TikTok outside. It’s none of my business. Just don’t do it in my house because we have pictures of the kids (we also don’t like guests)”, the woman wrote.\n\n\nMaid says she is not interested in working as a domestic helper any more\n\nSuggested post: “Can I check if the helper is not interested in working as a domestic helper anymore, Is she able to change jobs instead?”\n\nTo this, the helper would have to return to her home country after canceling her Work Permit (WP) and then re-apply to come to Singapore for skilled work.\nanswered: “Nope.. as far as MOM rules work permit is not allow (sic) to change skilled work… You must go back to your country and apply for skilled work otherwise you’ll stick with a work permit… Job here they prioritize PR/locals only not unless there is a sponsor but still you must apply in your own country”.\nSuggested: “It’s not easy but it’s possible. 1:20,000 ratio, perhaps. Each of us dream for a better paying job, who doesn’t? But before you dream high, ask yourself, are you qualified? To switch from domestic to non domestic sector, you must have the certificate/diploma and relevant experience”.\nEarlier this year, another employer asked if the insurance she bought for her current helper would be transferable to a new maid.\nIn an anonymous post to a support group for domestic helpers and employers alike, the employer wrote that her maid was a direct hire without an agency. She added that within a month of her maid’s arrival, it became clear that her maid was not keen on “doing helper duties but seriously trying to source for upskilling and join a different industry in Singapore. Everyone has their rights to chase their dreams and live a qualitative and happy life. but to do so at the expense of another is disappointing”.\nThe woman asked others for advice on the matter. She also thanked other helpers for “being the helping hand of the families here”.\nSuggested it was unfair of the helper to behave as such. One said: “That’s unfair. It's not good to take advantage of other people to chase your dream.. U can finish the contract then change job if u want.. Tell your helper if you blacklisted him/her, then working in Singapore will not be allowed by MOM.”\n\n",
        "featured_image_url": "https://i.ibb.co/1sbmxF7/2.png"
    },
    {
        "_id": "65d26def55012b65d9e0acec",
        "type":"blog",
        "title": "Helper Weekend No location For Rest",
        "content": "“Can a maid book a hotel room alone? and which hotel is cheaper? I really want to rest and sleep on sunday, so that no one can disturb me”. In the comments section, the helper added that she had to share a room with a child and an elderly woman who liked to talk in her sleep.\n\nAnother helper : “I go botanic garden and sleep there, so I can save money,,maybe u can try find comfortable places than (sic) must spend money for hotel feel sayang lehh,,,save money for beautiful future”. A netizen added: “Changi airport departure or arrival hall got couches and air con and free. I saw travellers laying on the ground with a cover over their heads and no one stops them”.\nonce a foreign domestic worker t asking for advice on what to do when she was made to sleep in the kitchen.  She asked: “What to do if your employer took your room and made you sleep in the kitchen?”. Despite not giving any other information as to how long these sleeping arrangements were for, or if her employer had given her a reason as to why she was evicted\nmany other maids who had experienced similar situations. Many also urged the helper to contact the Manpower Ministry (MOM) for help. We encourage her to try communicating with her employer because going to MOM might lead to her employers sending her back to her home country.\n\n",
        "featured_image_url": "https://i.ibb.co/1sbmxF7/2.png"
    },
    {
        "_id": "65d49e52b4a1627b576f7144",
        "type":"tips",
        "title": "Anxiety from Hiring a Maid",
        "content": "It's natural to feel anxious about hiring a maid, especially if it's your first time or if you're concerned about trusting someone with your home and belongings. When you've narrowed down your options, conduct interviews to get a sense of the cleaner's personality, work ethic, and experience. Consider asking for references and conducting background checks for added peace of mind.\n\nBesides, you can only be a good employer when you have a good domestic helper under your wing. Consider this a handy companion in choosing the right domestic helper you can trust with household chores, watch your baby sleep, or care for your elderly parents.\n\nAnd the only way to spot a good maid is by learning the most you can about them during the interview. So let this provide a helpful list of what you need to prepare for before coming face to face personally or via a video call with the applicants.\n\nClearly communicate your expectations, preferences, and any specific instructions or areas of focus with the maid. This can help ensure that they understand your needs and can provide the service you're looking for.\n\nLet's help you prepare for a domestic helper interview by formulating the right interview questions. This guide aims to make the selection process easier for potential employers and families.\n\nRemember that hiring a maid is a personal decision, and it's important to find someone you feel comfortable with and trust to take care of your home. Taking the time to find the right fit for your needs can help alleviate some of the anxiety associated with hiring a maid.\n\n",
        "featured_image_url": "https://i.ibb.co/TkfNyqT/maids-in-singapore-1-e1611466509713.jpg"
    },
    {
        "_id": "65d49e52b4a1627b576f7145",
        "type":"tips",
        "title": "Maid Management",
        "content": "Maid management is an essential aspect of maintaining a clean and organized home. Whether you have a live-in maid or hire cleaning services, effective management ensures that tasks are completed efficiently and to your satisfaction. In this comprehensive guide, we'll delve into the art of maid management, covering everything from hiring the right maid to establishing clear expectations and maintaining open communication. By mastering these techniques, you can enjoy a spotless home without the hassle.\n\nMaid management services are professional services that specialize in managing domestic helpers or maids. These services can be beneficial for individuals or families who require assistance with managing their household chores and ensuring that their maids are performing their duties effectively and efficiently. Maid management services typically offer a range of services, including:\n\n- Recruitment and Hiring: Maid management services can help you find and hire suitable maids based on your specific requirements. They may conduct interviews, background checks, and provide training to ensure that the maids are qualified and reliable.\n- Supervision and Monitoring: Once a maid is hired, maid management services can provide ongoing supervision and monitoring to ensure that the maid is performing their duties to your satisfaction. They may conduct regular check-ins and inspections to assess the maid's performance.\n- Training and Development: Maid management services may offer training programs to help maids improve their skills and efficiency. This can include training on cleaning techniques, time management, and customer service.\n- Performance Evaluation: Maid management services can help you evaluate the performance of your maid and provide feedback for improvement. They may also handle any disciplinary actions or terminations if necessary.\n- Administrative Support: Maid management services can assist with administrative tasks related to managing your maid, such as payroll management, scheduling, and contract management.\n- Conflict Resolution: If any issues or conflicts arise between you and your maid, maid management services can help facilitate communication and resolve conflicts in a professional and timely manner.\n\nOverall, maid management services can help ensure that your maid is well-trained, motivated, and performing their duties to the best of their abilities, allowing you to enjoy a clean and organized home without the stress of managing your maid directly.\n\n",
        "featured_image_url": "https://i.ibb.co/TkfNyqT/maids-in-singapore-1-e1611466509713.jpg"
    },
    {
        "_id": "65d49e52b4a1627b576f7146",
        "type":"tips",
        "title": "Family Struggles",
        "content": "When your domestic helper is struggling to get along with your family, it can create tension and affect the overall atmosphere at home.\n\n- Open Communication: Encourage open and honest communication between your family members and the domestic helper. Create a safe space where everyone can express their concerns and feelings.\n- Clarify Expectations: Clearly communicate your expectations regarding the helper's duties, behavior, and role within the family. Make sure everyone is on the same page to avoid misunderstandings.\n- Listen and Understand: Take the time to listen to your helper's perspective and try to understand their point of view. They may be facing challenges or cultural differences that are causing the conflict.\n- Mediation: If the situation does not improve, consider seeking the help of a mediator, such as a counselor or social worker, to facilitate a constructive conversation and find a resolution.\n- Provide Support: Offer support to your helper by providing resources, training, or counseling if needed. Address any issues that may be contributing to the conflict, such as workload or communication barriers.\n- Set Boundaries: Establish clear boundaries between your family and the helper to maintain a professional relationship. Encourage mutual respect and understanding.\n- Seek Professional Help: If the conflict persists and is affecting the well-being of your family or the helper, consider seeking professional help from a counselor or therapist who specializes in family dynamics.\n\nBy addressing the conflict early and proactively, you can work towards resolving the issues and creating a harmonious environment for your family and your domestic helper.\n\n",
        "featured_image_url": "https://i.ibb.co/TkfNyqT/maids-in-singapore-1-e1611466509713.jpg"
    },
    {
        "_id": "65d49e52b4a1627b576f7147",
        "type":"tips",
        "title": "Bad Habits",
        "content": "When she has poor personal hygiene, swears under her breath or has bad table manners. If any of your family members behave in similar ways, tell them you will not tolerate their bad habits. Hopefully, your helper will understand that she also needs to improve.\n\nClearly communicate your expectations regarding personal hygiene, language, and table manners. Provide specific examples to illustrate your points. You may offer support and resources to help your helper improve in these areas. This could include providing access to hygiene products, offering language or etiquette classes, or providing guidance on cultural norms.\n\nIf the behavior continues despite your efforts to address it, you may need to set clear boundaries and consequences. Make it clear that certain behaviors are not acceptable and that there will be consequences if they continue.\n\nIt's important to approach these conversations with empathy and a willingness to understand your helper's perspective. By addressing the issue calmly and respectfully, you can work towards finding a solution that is acceptable to everyone involved.\n\n",
        "featured_image_url": "https://i.ibb.co/TkfNyqT/maids-in-singapore-1-e1611466509713.jpg"
    }
]



